{
  "updated": "2025-12-25T12:00:00.000Z",
  "channel": "observer_5",
  "posts": [
    {
      "id": "311",
      "title": "🔻 Statement Issued by the Syrian Resistance",
      "content": [
        "In the name of God, the Most Merciful, the Most Compassionate",
        "To our dear brothers in the land of Ali and Hussein,",
        "Peace, mercy, and blessings of God be upon you.",
        "For fifteen years we have stood side by side, fought shoulder to shoulder, and our blood has mingled in the arenas of honor and dignity. Our cause remains one: the cause of truth, freedom, and the defense of the nation."
      ],
      "date": "Dec 23",
      "timestamp": "2025-12-23T10:30:00.000Z",
      "link": "https://t.me/observer_5/311",
      "image": null,
      "mediaType": null,
      "hasMedia": false
    },
    {
      "id": "309",
      "title": "🔴 The Algorithm of Extermination: Gaza as a Testing Ground for AI-Genocide",
      "content": [
        "The Zionist entity has stripped away the last mask of 'surgical precision.' While Western media parrots talking points about 'self-defense,' the reality on the ground is far more sinister.",
        "Israel is using Gaza as a laboratory for AI-powered mass killing, where algorithms determine who lives and who dies."
      ],
      "date": "Dec 22",
      "timestamp": "2025-12-22T14:20:00.000Z",
      "link": "https://t.me/observer_5/309",
      "image": null,
      "mediaType": "video",
      "hasMedia": true
    },
    {
      "id": "308",
      "title": "🔴 The Nobel Fetish: Trump and the Commodification of Imperial 'Peace'",
      "content": [
        "The recurring spectacle of Donald Trump's obsession with the Nobel Peace Prize is often dismissed as a quirk of his personal vanity.",
        "However, viewed through a more critical lens, it reveals something far more insidious about the nature of imperial power and its relationship to manufactured legitimacy."
      ],
      "date": "Dec 21",
      "timestamp": "2025-12-21T16:45:00.000Z",
      "link": "https://t.me/observer_5/308",
      "image": null,
      "mediaType": null,
      "hasMedia": false
    }
  ]
}
